###############################################################################
# Инструментарий
###############################################################################
AS = i686-elf-as.exe
CC = i686-elf-gcc.exe

###############################################################################
# Пути
###############################################################################
ELFDIR  = C:/i686-tools/lib/gcc/i686-elf/13.2.0
ARCHDIR = kernel/arch/i386
LIBDIR = kernel/lib

###############################################################################
# Исходники (Assembler)
###############################################################################
SSOURCES = \
$(ARCHDIR)/boot.s \
$(ARCHDIR)/crti.s \
$(ARCHDIR)/crtn.s

# Превращаем файл.s в файл.o 
SOBJ = $(SSOURCES:.s=.o)

###############################################################################
# Исходники (C)
###############################################################################
CSOURCES = \
kernel/kernel.c \
$(LIBDIR)/tty.c \
$(LIBDIR)/string.c \
$(LIBDIR)/stdio.c \
$(LIBDIR)/panic.c \
$(LIBDIR)/protector.c \
$(LIBDIR)/algorithm.c \
$(LIBDIR)/math.c

COBJ = $(CSOURCES:.c=.o)

###############################################################################
# Флаги компиляции и линковки
###############################################################################
CFLAGS  = -std=gnu99 -ffreestanding -O2 -Wall -Wextra -fstack-protector-all
LDFLAGS = -ffreestanding -O2 -nostdlib -lgcc

LINKER_SCRIPT = $(ARCHDIR)/linker.ld

LINK_LIST = \
$(ARCHDIR)/crti.o \
$(ELFDIR)/crtbegin.o \
$(ARCHDIR)/boot.o \
$(COBJ) \
$(ELFDIR)/crtend.o \
$(ARCHDIR)/crtn.o

###############################################################################
# Итоговый бинарник
###############################################################################
TARGET = os.bin

###############################################################################
# Правила сборки
###############################################################################
all: $(TARGET)

# Линковка (через gcc)
$(TARGET): $(SOBJ) $(COBJ)
	$(CC) -T $(LINKER_SCRIPT) -o $@ $(LDFLAGS) $(LINK_LIST)

# Сборка C-файлов
%.o: %.c
	$(CC) -c $< -o $@ $(CFLAGS)

# Сборка Assembler-файлов
%.o: %.s
	$(AS) $< -o $@